Wiz-IO/PIC32-FreeRTOS-LWIP-MBEDTLS/middleware/wizio/_pic32mz-crypt.c
/* pic32mz-crypt.c
 *
 * Copyright (C) 2006-2017 wolfSSL Inc.
 *
 * This file is part of wolfSSL.
 *
 * wolfSSL is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * wolfSSL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include "pic32mz-crypt.h"

#ifdef WOLFSSL_MICROCHIP_PIC32MZ

#ifdef WOLFSSL_PIC32MZ_CRYPT
#endif

#ifdef WOLFSSL_PIC32MZ_HASH
#endif


#if defined(WOLFSSL_PIC32MZ_CRYPT) || defined(WOLFSSL_PIC32MZ_HASH) 

inline __attribute__((always_inline)) word32 rotlFixed(word32 x, word32 y) {
    return (x << y) | (x >> (sizeof (y) * 8 - y));
}

inline __attribute__((always_inline)) word32 rotrFixed(word32 x, word32 y) {
    return (x >> y) | (x << (sizeof (y) * 8 - y));
}

inline __attribute__((always_inline)) word32 ByteReverseWord32(word32 value) {
    value = ((value & 0xFF00FF00) >> 8) | ((value & 0x00FF00FF) << 8);
    return rotlFixed(value, 16U);
}

void ByteReverseWords(word32* out, const word32* in, word32 byteCount) {
    word32 count = byteCount / (word32)sizeof (word32), i;
    for (i = 0; i < count; i++)
        out[i] = ByteReverseWord32(in[i]);

}

static int Pic32GetBlockSize(int algo) {
    switch (algo) {
        case PIC32_ALGO_HMAC1:
            return PIC32_BLOCKSIZE_HMAC;
        case PIC32_ALGO_SHA256:
            return PIC32_BLOCKSIZE_SHA256;
        case PIC32_ALGO_SHA1:
            return PIC32_BLOCKSIZE_SHA1;
        case PIC32_ALGO_MD5:
            return PIC32_BLOCKSIZE_MD5;
        case PIC32_ALGO_AES:
            return PIC32_BLOCKSIZE_AES;
        case PIC32_ALGO_TDES:
            return PIC32_BLOCKSIZE_TDES;
        case PIC32_ALGO_DES:
            return PIC32_BLOCKSIZE_DES;
    }
    return 0;
}

static int Pic32Crypto(const byte* in, int inLen, word32* out, int outLen,
        int dir, int algo, int cryptoalgo,

        /* For DES/AES only */
        word32* key, int keyLen, word32* iv, int ivLen) {
    int ret = 0;
    int blockSize = Pic32GetBlockSize(algo);
    volatile bufferDescriptor bd __attribute__((aligned(8)));
    securityAssociation sa __attribute__((aligned(8)));
    securityAssociation *sa_p;
    bufferDescriptor *bd_p;
    byte *in_p;
    byte *out_p;
    word32* dst;
    word32 padRemain;
    int timeout = 0xFFFFFF;

    /* check args */
    if (in == NULL || inLen <= 0 || out == NULL || blockSize == 0) {
        return BAD_FUNC_ARG;
    }

    /* check pointer alignment - must be word aligned */
    if (((size_t) in % sizeof (word32)) || ((size_t) out % sizeof (word32))) {
        return BUFFER_E; /* buffer is not aligned */
    }

    /* get uncached address */
    sa_p = KVA0_TO_KVA1(&sa);
    bd_p = KVA0_TO_KVA1(&bd);
    out_p = KVA0_TO_KVA1(out);
    in_p = KVA0_TO_KVA1(in);

    /* Sync cache if in physical memory (not flash) */
    if (PIC32MZ_IF_RAM(in_p)) {
        XMEMCPY(in_p, in, inLen);
    }

    /* Set up the Security Association */
    XMEMSET(sa_p, 0, sizeof (sa));
    sa_p->SA_CTRL.ALGO = algo;
    sa_p->SA_CTRL.ENCTYPE = dir;
    sa_p->SA_CTRL.FB = 1; /* first block */
    sa_p->SA_CTRL.LNC = 1; /* Load new set of keys */
    if (key) {
        /* cipher */
        sa_p->SA_CTRL.CRYPTOALGO = cryptoalgo;

        switch (keyLen) {
            case 32:
                sa_p->SA_CTRL.KEYSIZE = PIC32_KEYSIZE_256;
                break;
            case 24:
            case 8: /* DES */
                sa_p->SA_CTRL.KEYSIZE = PIC32_KEYSIZE_192;
                break;
            case 16:
                sa_p->SA_CTRL.KEYSIZE = PIC32_KEYSIZE_128;
                break;
        }

        dst = (word32*) KVA0_TO_KVA1(sa.SA_ENCKEY +
                (sizeof (sa.SA_ENCKEY) / sizeof (word32)) - (keyLen / sizeof (word32)));
        ByteReverseWords(dst, key, keyLen);

        if (iv && ivLen > 0) {
            sa_p->SA_CTRL.LOADIV = 1;
            dst = (word32*) KVA0_TO_KVA1(sa.SA_ENCIV +
                    (sizeof (sa.SA_ENCIV) / sizeof (word32)) - (ivLen / sizeof (word32)));
            ByteReverseWords(dst, iv, ivLen);
        }
    } else {
        /* hashing */
        sa_p->SA_CTRL.LOADIV = 1;
        sa_p->SA_CTRL.IRFLAG = 0; /* immediate result for hashing */

        dst = (word32*) KVA0_TO_KVA1(sa.SA_AUTHIV +
                (sizeof (sa.SA_AUTHIV) / sizeof (word32)) - (outLen / sizeof (word32)));
        ByteReverseWords(dst, out, outLen);
    }

    /* Set up the Buffer Descriptor */
    XMEMSET(bd_p, 0, sizeof (bd));
    bd_p->BD_CTRL.BUFLEN = inLen;
    padRemain = (inLen % 4); /* make sure buffer is 4-byte multiple */
    if (padRemain != 0) {
        bd_p->BD_CTRL.BUFLEN += (4 - padRemain);
    }
    bd_p->BD_CTRL.SA_FETCH_EN = 1; /* Fetch the security association */
    bd_p->BD_CTRL.PKT_INT_EN = 1; /* enable interrupt */
    bd_p->BD_CTRL.LAST_BD = 1; /* last buffer desc in chain */
    bd_p->BD_CTRL.LIFM = 1; /* last in frame */
    bd_p->SA_ADDR = (unsigned int) KVA_TO_PA(&sa);
    bd_p->SRCADDR = (unsigned int) KVA_TO_PA(in);
    if (key) {
        /* cipher */
        if (in != (byte*) out)
            XMEMSET(out_p, 0, outLen); /* clear output buffer */
        bd_p->DSTADDR = (unsigned int) KVA_TO_PA(out);
    } else {
        /* hashing */
        /* digest result returned in UPDPTR */
        bd_p->UPDPTR = (unsigned int) KVA_TO_PA(out);
    }
    bd_p->NXTPTR = (unsigned int) KVA_TO_PA(&bd);
    bd_p->MSGLEN = inLen; /* actual message size */
    bd_p->BD_CTRL.DESC_EN = 1; /* enable this descriptor */

    /* begin access to hardware */
    ret = wolfSSL_CryptHwMutexLock();
    if (ret == 0) {
        /* Software Reset the Crypto Engine */
        CECON = 1 << 6;
        while (CECON);

