Wiz-IO/PIC32-FreeRTOS-LWIP-MBEDTLS/middleware/wizio/_pic32mz-crypt.c
        /* Clear the interrupt flags */
        CEINTSRC = 0xF;

        /* Run the engine */
        CEBDPADDR = (unsigned int) KVA_TO_PA(&bd);
        CEINTEN = 0x07; /* enable DMA Packet Completion Interrupt */

        /* input swap, enable BD fetch and start DMA */
#if PIC32_NO_OUT_SWAP
        CECON = 0x25;
#else
        CECON = 0xa5; /* bit 7 = enable out swap */
#endif

        /* wait for operation to complete */
        while (CEINTSRCbits.PKTIF == 0 && --timeout > 0) {
        };

        /* Clear the interrupt flags */
        CEINTSRC = 0xF;

        /* check for errors */
        if (CESTATbits.ERROP || timeout <= 0) {
#if 0
            printf("PIC32 Crypto: ERROP %x, ERRPHASE %x, TIMEOUT %s\n",
                    CESTATbits.ERROP, CESTATbits.ERRPHASE, timeout <= 0 ? "yes" : "no");
#endif
            ret = ASYNC_OP_E;
        }

        wolfSSL_CryptHwMutexUnLock();

        if (iv && ivLen > 0) {
            /* set iv for the next call */
            if (dir == PIC32_ENCRYPTION) {
                XMEMCPY(iv, KVA0_TO_KVA1(out + (outLen - ivLen)), ivLen);
#if !PIC32_NO_OUT_SWAP
                /* hardware already swapped output, so we need to swap back */
                ByteReverseWords(iv, iv, ivLen);
#endif
            } else {
                ByteReverseWords(iv, KVA0_TO_KVA1(in + (inLen - ivLen)), ivLen);
            }
        }

        /* copy result to output */
#if PIC32_NO_OUT_SWAP
        /* swap bytes */
        ByteReverseWords(out, (word32*) out_p, outLen);
#elif defined(_SYS_DEVCON_LOCAL_H)
        /* sync cache */
        SYS_DEVCON_DataCacheInvalidate((word32) out, outLen);
#else
        XMEMCPY(out, out_p, outLen);
#endif
    }

    return ret;
}
#endif /* WOLFSSL_PIC32MZ_CRYPT || WOLFSSL_PIC32MZ_HASH */


#ifdef WOLFSSL_PIC32MZ_HASH

#ifdef WOLFSSL_PIC32MZ_LARGE_HASH

/* tunable large hash block size */
#ifndef PIC32_BLOCK_SIZE
#define PIC32_BLOCK_SIZE 256
#endif

#define PIC32MZ_MIN_BLOCK    64
#define PIC32MZ_MAX_BLOCK    (32*1024)

#ifndef PIC32MZ_MAX_BD
#define PIC32MZ_MAX_BD   2
#endif

#if PIC32_BLOCK_SIZE < PIC32MZ_MIN_BLOCK
#error Encryption block size must be at least 64 bytes.
#endif

/* Crypt Engine descriptor */
typedef struct {
    int currBd;
    int err;
    unsigned int msgSize;
    uint32_t processed;
    uint32_t dbPtr;
    int engine_ready;
    volatile bufferDescriptor bd[PIC32MZ_MAX_BD] __attribute__((aligned(8)));
    securityAssociation sa __attribute__((aligned(8)));
} pic32mz_desc;

static pic32mz_desc gLHDesc;
static uint8_t gLHDataBuf[PIC32MZ_MAX_BD][PIC32_BLOCK_SIZE] __attribute__((aligned(4), coherent));

void reset_engine(pic32mz_desc *desc, int algo) {
    int i;
    pic32mz_desc* uc_desc = KVA0_TO_KVA1(desc);

    wolfSSL_CryptHwMutexLock();

    /* Software reset */
    CECON = 1 << 6;
    while (CECON);

    /* Clear the interrupt flags */
    CEINTSRC = 0xF;

    /* Make sure everything is clear first before we setup */
    XMEMSET(desc, 0, sizeof (pic32mz_desc));
    XMEMSET((void *) &uc_desc->sa, 0, sizeof (uc_desc->sa));

    /* Set up the Security Association */
    uc_desc->sa.SA_CTRL.ALGO = algo;
    uc_desc->sa.SA_CTRL.LNC = 1;
    uc_desc->sa.SA_CTRL.FB = 1;
    uc_desc->sa.SA_CTRL.ENCTYPE = 1;
    uc_desc->sa.SA_CTRL.LOADIV = 1;

    /* Set up the Buffer Descriptor */
    uc_desc->err = 0;
    for (i = 0; i < PIC32MZ_MAX_BD; i++) {
        XMEMSET((void *) &uc_desc->bd[i], 0, sizeof (uc_desc->bd[i]));
        uc_desc->bd[i].BD_CTRL.LAST_BD = 1;
        uc_desc->bd[i].BD_CTRL.LIFM = 1;
        uc_desc->bd[i].BD_CTRL.PKT_INT_EN = 1;
        uc_desc->bd[i].SA_ADDR = KVA_TO_PA(&uc_desc->sa);
        uc_desc->bd[i].SRCADDR = KVA_TO_PA(&gLHDataBuf[i]);
        if (PIC32MZ_MAX_BD > i + 1)
            uc_desc->bd[i].NXTPTR = KVA_TO_PA(&uc_desc->bd[i + 1]);
        else
            uc_desc->bd[i].NXTPTR = KVA_TO_PA(&uc_desc->bd[0]);
        XMEMSET((void *) &gLHDataBuf[i], 0, PIC32_BLOCK_SIZE);
    }
    uc_desc->bd[0].BD_CTRL.SA_FETCH_EN = 1; /* Fetch the security association on the first BD */
    desc->dbPtr = 0;
    desc->currBd = 0;
    desc->msgSize = 0;
    desc->processed = 0;
    CEBDPADDR = KVA_TO_PA(&(desc->bd[0]));

    CEPOLLCON = 10;

#if PIC32_NO_OUT_SWAP
    CECON = 0x27;
#else
    CECON = 0xa7;
#endif
}

static void update_engine(pic32mz_desc *desc, const byte *input, word32 len,
        word32 *hash) {
    int total;
    pic32mz_desc *uc_desc = KVA0_TO_KVA1(desc);

    uc_desc->bd[desc->currBd].UPDPTR = KVA_TO_PA(hash);

    /* Add the data to the current buffer. If the buffer fills, start processing it
       and fill the next one. */
    while (len) {
        /* If we've been given the message size, we can process along the
           way.
           Enable the current buffer descriptor if it is full. */
        if (desc->dbPtr >= PIC32_BLOCK_SIZE) {
            /* Wrap up the buffer descriptor and enable it so the engine can process */
            uc_desc->bd[desc->currBd].MSGLEN = desc->msgSize;
            uc_desc->bd[desc->currBd].BD_CTRL.BUFLEN = desc->dbPtr;
            uc_desc->bd[desc->currBd].BD_CTRL.LAST_BD = 0;
            uc_desc->bd[desc->currBd].BD_CTRL.LIFM = 0;
            uc_desc->bd[desc->currBd].BD_CTRL.DESC_EN = 1;
            /* Move to the next buffer descriptor, or wrap around. */
            desc->currBd++;
            if (desc->currBd >= PIC32MZ_MAX_BD)
                desc->currBd = 0;
            /* Wait until the engine has processed the new BD. */
            while (uc_desc->bd[desc->currBd].BD_CTRL.DESC_EN);
            uc_desc->bd[desc->currBd].UPDPTR = KVA_TO_PA(hash);
            desc->dbPtr = 0;
        }
        if (!PIC32MZ_IF_RAM(input)) {
            /* If we're inputting from flash, let the BD have
               the address and max the buffer size */
            uc_desc->bd[desc->currBd].SRCADDR = KVA_TO_PA(input);
            total = (len > PIC32MZ_MAX_BLOCK ? PIC32MZ_MAX_BLOCK : len);
            desc->dbPtr = total;
            len -= total;
            input += total;
        } else {
            if (len > PIC32_BLOCK_SIZE - desc->dbPtr) {
                /* We have more data than can be put in the buffer. Fill what we can.*/
                total = PIC32_BLOCK_SIZE - desc->dbPtr;
                XMEMCPY(&gLHDataBuf[desc->currBd][desc->dbPtr], input, total);
                len -= total;
                desc->dbPtr = PIC32_BLOCK_SIZE;
                input += total;
            } else {
                /* Fill up what we have, but don't turn on the engine.*/
                XMEMCPY(&gLHDataBuf[desc->currBd][desc->dbPtr], input, len);
                desc->dbPtr += len;
                len = 0;
            }
        }
    }
}

