Wiz-IO/PIC32-FreeRTOS-LWIP-MBEDTLS/middleware/wizio/_pic32mz-crypt.c
static void start_engine(pic32mz_desc *desc) {
    /* Wrap up the last buffer descriptor and enable it */
    int bufferLen;
    pic32mz_desc *uc_desc = KVA0_TO_KVA1(desc);

    bufferLen = desc->dbPtr;
    if (bufferLen % 4)
        bufferLen = (bufferLen + 4) - (bufferLen % 4);
    uc_desc->bd[desc->currBd].BD_CTRL.BUFLEN = bufferLen;
    uc_desc->bd[desc->currBd].BD_CTRL.LAST_BD = 1;
    uc_desc->bd[desc->currBd].BD_CTRL.LIFM = 1;
    uc_desc->bd[desc->currBd].BD_CTRL.DESC_EN = 1;
}

void wait_engine(pic32mz_desc *desc, char *hash, int hash_sz) {
    int i;
    pic32mz_desc *uc_desc = KVA0_TO_KVA1(desc);
    unsigned int engineRunning;

    do {
        engineRunning = 0;
        for (i = 0; i < PIC32MZ_MAX_BD; i++) {
            engineRunning = engineRunning || uc_desc->bd[i].BD_CTRL.DESC_EN;
        }
    } while (engineRunning);

#if PIC32_NO_OUT_SWAP
    /* swap bytes */
    ByteReverseWords(hash, KVA0_TO_KVA1(hash), hash_sz);
#else
    /* copy output - hardware already swapped */
    XMEMCPY(hash, KVA0_TO_KVA1(hash), hash_sz);
#endif

    wolfSSL_CryptHwMutexUnLock();
}

#endif /* WOLFSSL_PIC32MZ_LARGE_HASH */

int wc_Pic32Hash(const byte* in, int inLen, word32* out, int outLen, int algo) {
    return Pic32Crypto(in, inLen, out, outLen, PIC32_ENCRYPTION, algo, 0, NULL, 0, NULL, 0);
}

int wc_Pic32HashCopy(hashUpdCache* src, hashUpdCache* dst) {
    /* mark destination as copy, so cache->buf is not free'd */
    if (dst) {
        dst->isCopy = 1;
    }
    return 0;
}

static int wc_Pic32HashUpdate(hashUpdCache* cache, byte* stdBuf, int stdBufLen, word32* digest, int digestSz, const byte* data, int len, int algo, void* heap) {
    int ret = 0;
    word32 newLenUpd, newLenPad, padRemain;
    byte* newBuf;
    int isNewBuf = 0;

#ifdef WOLFSSL_PIC32MZ_LARGE_HASH
    /* if final length is set then pass straight to hardware */
    if (cache->finalLen) {
        if (cache->bufLen == 0) {
            reset_engine(&gLHDesc, algo);
            gLHDesc.msgSize = cache->finalLen;
        }
        update_engine(&gLHDesc, data, len, digest);
        cache->bufLen += len; /* track progress for blockType */
        return 0;
    }
#endif

    /* cache updates */
    /* calculate new len */
    newLenUpd = cache->updLen + len;
    LOG("C:%d L:%d\n", cache->updLen, len);

    /* calculate padded len - pad buffer at 64-bytes for hardware */
    newLenPad = newLenUpd;
    padRemain = (newLenUpd % PIC32_BLOCKSIZE_HASH);
    if (padRemain != 0) {
        newLenPad += (PIC32_BLOCKSIZE_HASH - padRemain);
    }

    /* determine buffer source */
    if (newLenPad <= stdBufLen) {
        /* use standard buffer */
        newBuf = stdBuf;
    } else if (newLenPad > cache->bufLen) {
        /* alloc buffer */
        newBuf = (byte*) XMALLOC(newLenPad, heap, DYNAMIC_TYPE_HASH_TMP);
        if (newBuf == NULL) {
            if (cache->buf != stdBuf && !cache->isCopy) {
                XFREE(cache->buf, heap, DYNAMIC_TYPE_HASH_TMP);
                cache->buf = NULL;
                cache->updLen = cache->bufLen = 0;
            }
            LOG("ERROR: ", newLenPad);
            return MEMORY_E;
        } else {
            LOG("M: %d\n", newLenPad);
        }
        isNewBuf = 1;
        cache->isCopy = 0; /* no longer using copy buffer */
    } else {
        /* use existing buffer */
        newBuf = cache->buf;
    }
    if (cache->buf && cache->updLen > 0) {
        XMEMCPY(newBuf, cache->buf, cache->updLen);
        if (isNewBuf && cache->buf != stdBuf) {
            XFREE(cache->buf, heap, DYNAMIC_TYPE_HASH_TMP);
        }
    }
    XMEMCPY(newBuf + cache->updLen, data, len);
    cache->buf = newBuf;
    cache->updLen = newLenUpd;
    cache->bufLen = newLenPad;
    return ret;
}

static int wc_Pic32HashFinal(hashUpdCache* cache, byte* stdBuf,
        word32* digest, byte* hash, int digestSz, int algo, void* heap) {
    int ret = 0;

    /* if room add the pad */
    if (cache->buf && cache->updLen < cache->bufLen) {
        cache->buf[cache->updLen] = 0x80;
    }

#ifdef WOLFSSL_PIC32MZ_LARGE_HASH
    if (cache->finalLen) {
        start_engine(&gLHDesc);
        wait_engine(&gLHDesc, (char*) digest, digestSz);
        XMEMCPY(hash, digest, digestSz);
        cache->finalLen = 0;
    } else
#endif
    {
        if (cache->updLen == 0) {
            /* handle empty input */
            switch (algo) {
                case PIC32_ALGO_SHA256:
                {
                    const char* sha256EmptyHash =
                            "\xe3\xb0\xc4\x42\x98\xfc\x1c\x14\x9a\xfb\xf4\xc8\x99\x6f\xb9"
                            "\x24\x27\xae\x41\xe4\x64\x9b\x93\x4c\xa4\x95\x99\x1b\x78\x52"
                            "\xb8\x55";
                    XMEMCPY(hash, sha256EmptyHash, digestSz);
                    break;
                }
                case PIC32_ALGO_SHA1:
                {
                    const char* shaEmptyHash =
                            "\xda\x39\xa3\xee\x5e\x6b\x4b\x0d\x32\x55\xbf\xef\x95\x60\x18"
                            "\x90\xaf\xd8\x07\x09";
                    XMEMCPY(hash, shaEmptyHash, digestSz);
                    break;
                }
                case PIC32_ALGO_MD5:
                {
                    const char* md5EmptyHash =
                            "\xd4\x1d\x8c\xd9\x8f\x00\xb2\x04\xe9\x80\x09\x98\xec\xf8\x42"
                            "\x7e";
                    XMEMCPY(hash, md5EmptyHash, digestSz);
                    break;
                }
            } /* switch */
        } else {
            ret = wc_Pic32Hash(cache->buf, cache->updLen, digest, digestSz, algo);
            if (ret == 0) {
                XMEMCPY(hash, digest, digestSz);
            }
        }


    }

    //[WizIO]
    if (cache->buf && cache->buf != stdBuf && !cache->isCopy) {
        XFREE(cache->buf, heap, DYNAMIC_TYPE_HASH_TMP);
    }

    cache->buf = NULL;
    cache->bufLen = cache->updLen = 0;
    return ret;
}

/* API's for compatability with Harmony wrappers - not used */
#ifndef NO_MD5

