Wiz-IO/PIC32-FreeRTOS-LWIP-MBEDTLS/middleware/wizio/_pic32mz-crypt.c
int wc_InitMd5_ex(Md5* md5, void* heap, int devId) {
    (void) heap;
    (void) devId;
    if (md5 == NULL)
        return BAD_FUNC_ARG;
    XMEMSET(md5, 0, sizeof (Md5));
    reset_engine(&gLHDesc, PIC32_ALGO_MD5);
    return 0;
}

int wc_Md5Update(Md5* md5, const byte* data, word32 len) {
    if (md5 == NULL || (data == NULL && len > 0))
        return BAD_FUNC_ARG;
    return wc_Pic32HashUpdate(&md5->cache, (byte*) md5->buffer, sizeof (md5->buffer), md5->digest, MD5_DIGEST_SIZE, data, len, PIC32_ALGO_MD5, md5->heap);
}

int wc_Md5Final(Md5* md5, byte* hash) {
    int ret;
    if (md5 == NULL || hash == NULL)
        return BAD_FUNC_ARG;
    ret = wc_Pic32HashFinal(&md5->cache, (byte*) md5->buffer, md5->digest, hash, MD5_DIGEST_SIZE, PIC32_ALGO_MD5, md5->heap);
    wc_InitMd5_ex(md5, md5->heap, INVALID_DEVID); /* reset state */
    return ret;
}

#endif /* !NO_MD5 */



#ifndef NO_SHA

int wc_InitSha_ex(Sha* sha, void* heap, int devId) {
    (void) heap;
    (void) devId;
    if (sha == NULL)
        return BAD_FUNC_ARG;
    XMEMSET(sha, 0, sizeof (Sha));
    reset_engine(&gLHDesc, PIC32_ALGO_SHA1);
    return 0;
}

int wc_ShaUpdate(Sha* sha, const byte* data, word32 len) {
    if (sha == NULL || (data == NULL && len > 0))
        return BAD_FUNC_ARG;
    return wc_Pic32HashUpdate(&(sha->cache), (byte*) sha->buffer, sizeof (sha->buffer), sha->digest, SHA_DIGEST_SIZE, data, len, PIC32_ALGO_SHA1, NULL);
}

int wc_ShaFinal(Sha* sha, byte* hash) {
    int ret;
    if (sha == NULL || hash == NULL)
        return BAD_FUNC_ARG;
    ret = wc_Pic32HashFinal(&(sha->cache), (byte*) sha->buffer, sha->digest, hash, SHA_DIGEST_SIZE, PIC32_ALGO_SHA1, NULL);
    wc_InitSha_ex(sha, sha->heap, INVALID_DEVID); /* reset state */
    return ret;
}

#endif /* !NO_SHA */
#ifndef NO_SHA256

int wc_InitSha256_ex(Sha256* sha256, void* heap, int devId) {
    (void) heap;
    (void) devId;
    if (sha256 == NULL)
        return BAD_FUNC_ARG;
    XMEMSET(sha256, 0, sizeof (Sha256));
    reset_engine(&gLHDesc, PIC32_ALGO_SHA256);
    return 0;
}

int wc_Sha256Update(Sha256* sha256, const byte* data, word32 len) {
    if (sha256 == NULL || (data == NULL && len > 0))
        return BAD_FUNC_ARG;
    return wc_Pic32HashUpdate(&sha256->cache, (byte*) sha256->buffer, sizeof (sha256->buffer), sha256->digest, SHA256_DIGEST_SIZE, data, len, PIC32_ALGO_SHA256, NULL);
}

int wc_Sha256Final(Sha256* sha256, byte* hash) {
    int ret;
    if (sha256 == NULL || hash == NULL)
        return BAD_FUNC_ARG;
    ret = wc_Pic32HashFinal(&sha256->cache, (byte*) sha256->buffer, sha256->digest, hash, SHA256_DIGEST_SIZE, PIC32_ALGO_SHA256, sha256->heap);
    wc_InitSha256_ex(sha256, sha256->heap, INVALID_DEVID); /* reset state */
    return ret;
}

////////////////////////////////////////////////////////////////////////////////

int wc_InitSha224(Sha224* sha224) {
    int ret = 0;
    if (sha224 == NULL)
        return BAD_FUNC_ARG;
    sha224->digest[0] = 0xc1059ed8;
    sha224->digest[1] = 0x367cd507;
    sha224->digest[2] = 0x3070dd17;
    sha224->digest[3] = 0xf70e5939;
    sha224->digest[4] = 0xffc00b31;
    sha224->digest[5] = 0x68581511;
    sha224->digest[6] = 0x64f98fa7;
    sha224->digest[7] = 0xbefa4fa4;
    sha224->buffLen = 0;
    sha224->loLen = 0;
    sha224->hiLen = 0;
    reset_engine(&gLHDesc, PIC32_ALGO_SHA256);
    return ret;
}

int wc_InitSha224_ex(Sha224* sha224, void* heap, int devId) {
    (void) heap;
    (void) devId;
    if (sha224 == NULL)
        return BAD_FUNC_ARG;
    return wc_InitSha224(sha224);
}

int wc_Sha224Update(Sha224* sha224, const byte* data, word32 len) {
    if (sha224 == NULL || (data == NULL && len > 0))
        return BAD_FUNC_ARG;
    return wc_Sha256Update((Sha256*) sha224, data, len);
}

int wc_Sha224Final(Sha224* sha224, byte* hash) {
    int ret;
    if (sha224 == NULL || hash == NULL)
        return BAD_FUNC_ARG;
    ret = wc_Pic32HashFinal(&sha224->cache, (byte*) sha224->buffer, sha224->digest, hash, SHA224_DIGEST_SIZE, PIC32_ALGO_SHA256, NULL);
    if (ret != 0)
        return ret;
    XMEMCPY(hash, sha224->digest, WC_SHA224_DIGEST_SIZE);
    return wc_InitSha224(sha224); /* reset state */
}
////////////////////////////////////////////////////////////////////////////////
#endif /* !NO_SHA256 */

#endif /* WOLFSSL_PIC32MZ_HASH */












#ifdef WOLFSSL_PIC32MZ_CRYPT
#if !defined(NO_AES)

int wc_Pic32AesCrypt(word32 *key, int keyLen, word32 *iv, int ivLen,
        byte* out, const byte* in, word32 sz,
        int dir, int algo, int cryptoalgo) {
    return Pic32Crypto(in, sz, (word32*) out, sz, dir, algo, cryptoalgo,
            key, keyLen, iv, ivLen);
}
#endif /* !NO_AES */

#ifndef NO_DES3

int wc_Pic32DesCrypt(word32 *key, int keyLen, word32 *iv, int ivLen,
        byte* out, const byte* in, word32 sz,
        int dir, int algo, int cryptoalgo) {
    return Pic32Crypto(in, sz, (word32*) out, sz, dir, algo, cryptoalgo,
            key, keyLen, iv, ivLen);
}
#endif /* !NO_DES3 */
#endif /* WOLFSSL_PIC32MZ_CRYPT */


#if !defined(NO_AES)

/* Free Aes from use with async hardware */
void wc_AesFree(Aes * aes) {
    if (aes == NULL)
        return;
}

static int wc_AesEncrypt(Aes* aes, const byte* inBlock, byte* outBlock) {
    return wc_Pic32AesCrypt(aes->key, aes->keylen, NULL, 0,
            outBlock, inBlock, AES_BLOCK_SIZE,
            PIC32_ENCRYPTION, PIC32_ALGO_AES, PIC32_CRYPTOALGO_RECB);
}

static int wc_AesDecrypt(Aes* aes, const byte* inBlock, byte* outBlock) {
    return wc_Pic32AesCrypt(aes->key, aes->keylen, NULL, 0,
            outBlock, inBlock, AES_BLOCK_SIZE,
            PIC32_DECRYPTION, PIC32_ALGO_AES, PIC32_CRYPTOALGO_RECB);
}

int wc_AesCbcEncrypt(Aes* aes, byte* out, const byte* in, word32 sz) {
    int ret;
    /* hardware fails on input that is not a multiple of AES block size */
    if (sz % AES_BLOCK_SIZE != 0) {
        return BAD_FUNC_ARG;
    }
    ret = wc_Pic32AesCrypt(
            aes->key, aes->keylen, aes->reg, AES_BLOCK_SIZE,
            out, in, sz, PIC32_ENCRYPTION,
            PIC32_ALGO_AES, PIC32_CRYPTOALGO_RCBC);

    /* store iv for next call */
    if (ret == 0) {
        XMEMCPY(aes->reg, out + sz - AES_BLOCK_SIZE, AES_BLOCK_SIZE);
    }
    return ret;
}

int wc_AesCbcDecrypt(Aes* aes, byte* out, const byte* in, word32 sz) {
    int ret;
    byte scratch[AES_BLOCK_SIZE];
    /* hardware fails on input that is not a multiple of AES block size */
    if (sz % AES_BLOCK_SIZE != 0) {
        return BAD_FUNC_ARG;
    }
    XMEMCPY(scratch, in + sz - AES_BLOCK_SIZE, AES_BLOCK_SIZE);
    ret = wc_Pic32AesCrypt(
            aes->key, aes->keylen, aes->reg, AES_BLOCK_SIZE,
            out, in, sz, PIC32_DECRYPTION,
            PIC32_ALGO_AES, PIC32_CRYPTOALGO_RCBC);
    /* store iv for next call */
    if (ret == 0) {
        XMEMCPY((byte*) aes->reg, scratch, AES_BLOCK_SIZE);
    }
    return ret;
}

int wc_AesCtrEncryptBlock(Aes* aes, byte* out, const byte* in) {
    word32 tmpIv[AES_BLOCK_SIZE / sizeof (word32)];
    XMEMCPY(tmpIv, aes->reg, AES_BLOCK_SIZE);
    return wc_Pic32AesCrypt(
            aes->key, aes->keylen, tmpIv, AES_BLOCK_SIZE,
            out, in, AES_BLOCK_SIZE,
            PIC32_ENCRYPTION, PIC32_ALGO_AES, PIC32_CRYPTOALGO_RCTR);
}
#endif


#endif /* WOLFSSL_MICROCHIP_PIC32MZ */
